Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/the_president/functions_of_the_president.html.txt.tmx
Source language: en
Languages: ga

source: The President is the Head of State, although they play a mainly ceremonial role in the running of the State
ga: Is é/í an tUachtarán Ceann an Stáit, cé gur ról deasghnách den chuid is mó atá aige/aici i dtaobh riaradh an Stáit

source: The current President of Ireland is Michael D
ga: Is í Mícheál D. Ó hUiginn Uachtarán na hÉireann faoi láthair

source: Higgins, who commenced his first term on 11 November 2011
ga: Chuir sé tús lena chéad téarma mar Uachtarán ar 11 Samhain 2011

source: The Government must approve all Presidential communications, messages or addresses, both to the Oireachtas and to the public
ga: Ní mór don Rialtas gach cumarsáid, teachtaireacht nó aitheasc ón Uachtarán chuig dá theach an Oireachtais agus chuig an bpobal a cheadú

source: Many of the powers of the President can only be exercised on the advice of the Government
ga: Is ar chomhairle an Rialtais amháin is cead don Uachtarán cuid mhaith dá c(h)umhachtaí a chomhlíonadh

source: This means that if the President wishes to exercise a power, they must first obtain the advice and agreement of the Government
ga: Mar sin más mian leis an Uachtarán cumhacht a chomhlíonadh ní mór dó/di comhairle agus comhaontú an Rialtais a fháil ar dtús

source: The President also possesses some powers that they cannot exercise without first consulting with the Council of State
ga: Tá cumhachtaí ag an Uachtarán nach féidir leis/léi a chomhlíonadh gan dul i gcomhairle roimh ré leis an gComhairle Stáit
